content/ephemeris/2025-07-07.org
#+startup: content indent

[[file:../index.org][Giovanni's Diary]] > [[file:../autobiography/chronological.org][Chronological]] > [[file:ephemeris.org][Ephemeris]] > [[file:entries.org][Entries]] >

* 2025-07-07 - Math riddle
:PROPERTIES:
:RSS: true
:DATE: 07 Jul 2025 00:00 GMT
:CATEGORY: Ephemeris
:AUTHOR: Giovanni Santini
:LINK: https://giovanni-diary.netlify.app/ephemeris/2025-07-07.html
:END:
#+INDEX: Giovanni's Diary!Ephemeris!2025-07-07 - Math riddle

I am happy that everything went great today. I didn't feel stressed or
anxious, I was a bit confused on what to do at the beginning but the
feeling went away and I already feel comfortable in the office.

I'll write some more thoughts in the following days, right now I am
puzzled by a riddle written in the blackboard of the office, and It
goes like this:

Gauss and Euler are playing a game, there are two secret numberrs $p$
and $s$ between $2$ and $99$. Gauss knows the value $g = p*s$ and Euler knows the value $e
= p + s$. Then they say to eachother:

#+begin_src
  Gaus: I don't know p and s
  Euler: I am not surprised
  Gaus: Now I know
  Euled: Now I know too
#+end_src

What are $p$ and $s$?

I have been playing with numbers for a few hours but I can't figure
this out!

Expenses so far, I marked the refundable things and I will count them
in the total balance until I get the refunds:

#+begin_src
 Expenses                           ||           
------------------------------------++-----------
 expenses:food                      ||    $31.82 
 expenses:food:non-essential        ||     $9.20 
 expenses:food:refundable           ||    $10.00 
 expenses:household:bathroom        ||     $7.86 
 expenses:household:kitchen         ||     $8.74 
 expenses:household:washing-machine ||     $7.49 
 expenses:legal:refundable          ||    $19.92 
 expenses:non-essential             ||     $4.45 
 expenses:rent                      ||   $656.00 
 expenses:rent:refundable           ||   $750.00 
 expenses:travel:arrival            ||    $39.47 
 expenses:travel:public-transport   ||    $60.50 
------------------------------------++-----------
                                    ||  $1605.45
#+end_src

-----

Travel: [[file:ephemeris.org][Ephemeris]], [[file:../theindex.org][Index]] 
