public/ephemeris/2025-07-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-org8f2d19f" class="outline-2">
<h2 id="org8f2d19f">2025-07-07 - Math riddle</h2>
<div class="outline-text-2" id="text-org8f2d19f">
<p>
I am happy that everything went great today. I didn't feel stressed or
anxious, I was a bit confused on what to do at the beginning but the
feeling went away and I already feel comfortable in the office.
</p>

<p>
I'll write some more thoughts in the following days, right now I am
puzzled by a riddle written in the blackboard of the office, and it
goes like this:
</p>

<p>
Gauss and Euler are playing a game, there are two secret numberrs \(p\)
and \(s\) between \(2\) and \(99\). Gauss knows the value \(g = p*s\) and Euler knows the value \(e
= p + s\). Then they say to eachother:
</p>

<pre class="example">
Gaus: I don't know p and s
Euler: I am not surprised
Gaus: Now I know
Euled: Now I know too
</pre>

<p>
What are \(p\) and \(s\)?
</p>

<p>
I have been playing with numbers for a few hours but I can't figure
this out!
</p>

<p>
Expenses so far, I marked the refundable things and I will count them
in the total balance until I get the refunds:
</p>

<pre class="example">
 Expenses                           ||           
------------------------------------++-----------
 expenses:food                      ||    $31.82 
 expenses:food:non-essential        ||     $9.20 
 expenses:food:refundable           ||    $10.00 
 expenses:household:bathroom        ||     $7.86 
 expenses:household:kitchen         ||     $8.74 
 expenses:household:washing-machine ||     $7.49 
 expenses:legal:refundable          ||    $19.92 
 expenses:non-essential             ||     $4.45 
 expenses:rent                      ||   $656.00 
 expenses:rent:refundable           ||   $750.00 
 expenses:travel:arrival            ||    $39.47 
 expenses:travel:public-transport   ||    $60.50 
------------------------------------++-----------
                                    ||  $1605.45
</pre>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
